{
  "chunk-971877fa92dfe3d24b38d3b9d9d1d244": {
    "tokens": 1200,
    "content": "Contract Name: contract_sample_2\nAIRCRAFT LEASE AGREEMENT \nThis Agreement is made on August 10, 2025, by and between:\nLessor: AeroSky Rentals Ltd., a company organized and existing under the laws of Canada, having its\nprincipal office at 789 Skyway Street, Toronto, Ontario, Canada.\nLessee: BlueJet Airways Corp., a company organized and existing under the laws of the United\nKingdom, having its principal office at 321 Flightpath Avenue, London, England, UK.\nWHEREAS, the Lessor owns certain aircraft described in Exhibit A of this Agreement and desires to\nlease the aircraft to the Lessee, and the Lessee desiresto lease the aircraft from the Lessor, upon the\nterms and conditions set forth in this Agreement.\nNOW, THEREFORE, in consideration of the mutual covenants herein contained, the parties agree as\nfollows:\nDESCRIPTIONPAGE\nSection Description Page\nSection 1 Definitions 1\nSection 2 Lease and Conditions 2\nSection 3 Delivery and Acceptance; Term 3\nSection 4 Rent 4\nSection 5 Disclaimer 5\nSection 6 Possession and Use 6\nSection 7 Information and Inspection 7\nSection 8 Covenants of Lessee 8\nSection 9 Maintenance of Aircraft 12\nSection 10 General Tax Indemnity 13\nSection 11 CasualtyOccurrences 14\nSection 12 Insurance 17\nSection 13 Indemnification 21\nSection 14 Liens 21\nSection 15 Perfection of Title and Further Assurances 22\nSection 16 Return of Aircraft and Records 24\nSection 17 Events of Default 25\nSection 18 Remedies 27\nSection 19 Alienation 28\nSection 20 Miscellaneous 28\nExhibit A Aircraft Specifications A1\nExhibit B List of Manuals, Documents and Records B1\nExhibit C Definitions and Values C1\nExhibit D Maintenance Payment Provisions D1\nExhibit E Delivery Conditions E1\nExhibit F Return Conditions F1\nExhibit G Lease Supplement No.1 G1\nExhibit H\nCertificate ofDelivery Technical\nAcceptance\nH1\nExhibit I\nCertificate of Redelivery Technical\nAcceptance\nI1\nExhibit J Deregistration Power of Attorney J1\n1\nSECTION 1: DEFINITIONS\nIn this Agreement, the following termsshall have the meaningsset forth below:\n• Aircraft: The SkyLiner A350, having the manufacturer's serial number 2098745 and\nregistration number G12345, as described in Exhibit A.\n• Basic Rent: The amount payable by the Lessee for the lease of the Aircraft, calculated as\n$180,000 per month, as detailed in Section 4.\n• Delivery Date: The date on which the Aircraft is delivered to and accepted by the Lessee, as\ndescribed in Section 3.\n• Lease Term: The term during which the Aircraft isleased to the Lessee, as specified in\nSection 3.\n2\nSECTION 2: LEASE AND CONDITIONS\nThe Lessor hereby leasesthe Aircraft to the Lessee, and the Lessee agreesto lease the Aircraft from\nthe Lessor, on the terms and conditions set forth in this Agreement, including but not limited to:\n1. Condition Precedent: The lease shall commence upon the fulfillment of all conditions\nprecedentset forth in Section 3.\n2. Term of Lease: The Lease Term shall be 72 months commencing on the Delivery Date.\n3. Condition of Aircraft: The Aircraftshall be delivered in the condition specified in Exhibit B\n(Delivery Conditions).\n3\nSECTION3: DELIVERY AND ACCEPTANCE; TERM\n1. Delivery: The Aircraftshall be delivered by the Lessor at London Heathrow Airport on\nSeptember 15, 2025.\n2. Acceptance: The Lessee shall inspect the Aircraft and sign the Certificate of Delivery\nTechnical Acceptance (Exhibit D).\n3. Lease Term: The Lease Term shall commence on September 15, 2025, and continue for 72\nmonths, subject to early termination under Section 17.\n4\nSECTION 4: RENT\n1. Basic Rent: The Lessee shall pay a Basic Rent of $180,000 per month, payable in advance on\nthe first business day of each month.\n2. Additional Costs: Any costs arising from the Lessee’s use of the Aircraft, such asinsurance,\ntaxes, or operational expenses, are summarized below:\nCategory Cost Description Frequency Estimated Annual\nAmount (USD)\nInsurance Hull and liability\ncoverage\nAnnually $2,200,000\nMaintenance\nReserve\nEngine and airframe\nmaintenance\nMonthly $40,000\nFuel Costs Based on flight hours\nand routes\nPer flight $450/hour\nAirport Fees Landing, parking,\nhandling\nPer use $1,800 per landing\nCrew Costs Pilot and cabin crew\nsalaries\nMonthly $90,000\n5\nSECTION 5: DISCLAIMER\n1. As-Is Condition: The Aircraft isleased on an \"AS-IS, WHERE-IS\" basis. The Lessor makes no\nrepresentations or warranties, express or implied, with respect to the Aircraft, except as\nexpressly stated in this Agreement.\n2. No Warranty of Merchantability or Fitness: The Lessor disclaims any warranty of\nmerchantability or fitness for a particular purpose.\n6\nSECTION 6: POSSESSION AND USE\n1. Possession: The Lessee shall take possession of the Aircraft on the Delivery Date and shall be\nresponsible for its condition from that date onward.\n2. Use: The Lessee agreesto utilize the Aircraft exclusively for commercial charter services and\nmust adhere to all relevant laws, regulations, and aviation safety standards in each\njurisdiction in which the Aircraft operates",
    "chunk_order_index": 0,
    "full_doc_id": "doc-b3a6e9bbeadb1ead45aa26dc71caade6"
  },
  "chunk-14fe2b0be5933b738e86e453c851889e": {
    "tokens": 1200,
    "content": "disclaims any warranty of\nmerchantability or fitness for a particular purpose.\n6\nSECTION 6: POSSESSION AND USE\n1. Possession: The Lessee shall take possession of the Aircraft on the Delivery Date and shall be\nresponsible for its condition from that date onward.\n2. Use: The Lessee agreesto utilize the Aircraft exclusively for commercial charter services and\nmust adhere to all relevant laws, regulations, and aviation safety standards in each\njurisdiction in which the Aircraft operates.\n3. Operational Control: The Lessee shall retain complete operational control over the Aircraft\nthroughout the Lease Term, including the selection and management of pilots, crew, and all\npassengers.\n4. Base Location: The Aircraft will be stationed at London Heathrow International Airport or any\nalternative location mutually agreed upon in writing by both parties.\n7\nSECTION7: INFORMATIONAND INSPECTION\n1. Records: The Lessee shall keep comprehensive flight logs, maintenance records, and\ntechnical documentation as mandated by relevant aviation authorities. A copy of these\nrecords shall be provided to the Lessor for inspection upon request.\n2. Inspection: The Lessor, or its authorized representatives, shall have the right to inspect the\nAircraft at any reasonable time and with reasonable notice. Such inspections may encompass\na review of the Aircraft's condition, maintenance history, and adherence to the terms of this\nAgreement.\n3. Reporting: The Lessee shall submit to the Lessor regular reports on the Aircraft's usage,\ndetailing flight hours, cycles, and any significant incidents, to be provided quarterly rather\nthan monthly.\n8\nSECTION 8: COVENANTS OF LESSEE\nCompliance with Laws:\nThe Lessee shall, at all times during the Lease Term, adhere to all applicable local, national, and\ninternational laws,rules, treaties, and regulations governing the operation, use, registration, and\nmaintenance of the Aircraft. This includes, but is not limited to, regulations established by the\nTransportation Safety Administration (TSA), the Civil Aviation Authority (CAA), and the\nInternational Air Transport Association (IATA).\nThe Lessee shall secure and uphold all licenses, permits, and certifications necessary for the\noperation of the Aircraft, whichmay include commercial pilot licenses, airworthiness certificates,\nand environmental compliance permits.\nThe Lessee shall ensure that the Aircraft is operated solely by licensed and qualified pilots and crew\nmembers, as mandated by relevant aviation authorities, and in accordance with the Aircraft's\noperational manuals and safety guidelines.\nIn the event of any changesin regulations that impact the operation or maintenance of the Aircraft,\nthe Lessee agrees to promptly implement any required modifications or adjustments to ensure\ncompliance with such laws or regulations at its own expense.\nMaintenance Obligations:\nThe Lessee shall ensure that the Aircraft is maintained in an airworthy condition, consistent with the\nstandardsrequired by the manufacturer and all applicable aviation authorities. The Lessee shall\nperform all routine and scheduled maintenance, repairs, and inspections, including but not limited\nto:\nA-checks, B-checks, C-checks, and D-checks asspecified in the Aircraft’s maintenance schedule and in\naccordance with the manufacturer’s maintenance manual;\nEngine inspections, including borescope inspections, and overhauls asrequired by the engine\nmanufacturer’s maintenance program;\nLanding gear inspections, refurbishments, or replacements asspecified by the manufacturer or\nregulatory authorities.\nThe Lessee shall ensure that all repairs are carried out by certified and approved maintenance\norganizations, and that the Aircraft is operated in accordance with any Airworthiness Directives\n(ADs), Service Bulletins(SBs), and Mandatory Modifications issued by the manufacturer or aviation\nauthorities.\nThe Lessee agreesto maintain accurate and up-to-date maintenance records, logs, and technical\ndocumentsfor the Aircraft, and to make such records available to the Lessor for inspection upon\nrequest. Such records shall include:\nFlight logs, detailing all flight hours and cycles;\nMaintenance logs, documenting all repairs, inspections, and modifications made to the Aircraft;\n9\nComponent records, detailing the status and life-cycle of key componentssuch as engines, landing\ngear, and avionics.\nThe Lessee shall bear all costs associated with maintaining,repairing, and operating the Aircraft,\nincluding but not limited to labor, parts, materials, and regulatory fees.\nOperational Insurance:\nThe Lessee shall, at its own expense, procure and maintain comprehensive aviation insurance\ncoverage throughout the entire Lease Term. Thisinsurance shall include, but not be limited to, the\nfollowing types of coverage:\n1. Hull All-Risk Insurance: Covering the full replacement value of the Aircraft against physical\nloss or damage due to any cause, including accidents, fire, theft, vandalism, and natural\ndisasters.\n2. Hull War Risk Insurance: Covering loss or damage resulting from acts of war, terrorism,\nhijacking, or other hostile actions, as well as confiscation or seizure by government entities.\n3. Third-Party Liability Insurance: Providing coverage for bodily injury, death, and property\ndamage to third parties, with minimum liability limits of $600 million per occurrence, or such\nhigher amounts as may be mandated by applicable law or required by the Lessor.\n4. Passenger Liability Insurance: Covering the Lessee'slegal liability for bodily injury or death\nof passengers, with a minimum coverage of $150,000 per passenger or as stipulated by\napplicable law.\nAll insurance policies must:\n1. Name the Lessor as an additional insured and loss payee.\n2. Be issued by reputable insurance carriers with an A.M. Best rating of at least A or an\nequivalentstandard.\n3. Include a provision requiring 30 days' prior written notice to the Lessor before any\ncancellation, significant modification, or expiration of the policy.\n4. Incorporate a waiver ofsubrogation in",
    "chunk_order_index": 1,
    "full_doc_id": "doc-b3a6e9bbeadb1ead45aa26dc71caade6"
  },
  "chunk-7cdb7503adf72476b757ba7f524ae8e2": {
    "tokens": 1200,
    "content": "per passenger or as stipulated by\napplicable law.\nAll insurance policies must:\n1. Name the Lessor as an additional insured and loss payee.\n2. Be issued by reputable insurance carriers with an A.M. Best rating of at least A or an\nequivalentstandard.\n3. Include a provision requiring 30 days' prior written notice to the Lessor before any\ncancellation, significant modification, or expiration of the policy.\n4. Incorporate a waiver ofsubrogation in favor of the Lessor.\nThe Lessee agrees to furnish the Lessor with certificates of insurance that demonstrate compliance\nwith this Section, delivering such certificates on or before the commencement of the Lease Term and\nupon each renewal or replacement of the policies.\nIn the event of any claim, the Lessee shall promptly notify the Lessor and fully cooperate with the\nLessor and the insurance provider in the claims process. This includes providing all necessary\ndocumentation, granting accessto the Aircraft, and participating in any related investigations.\n10\nOperational Control and Use of the Aircraft:\nThe Lessee shall maintain full operational control of the Aircraft during the Lease Term and agrees\nthat the Aircraft will only be operated for lawful purposes, and in accordance with:\nThe manufacturer’s operating manual;\nThe approved operating limits and flight performance standards;\nThe specific purposes outlined in the lease, such as commercial passenger transport or cargo\noperations.\nThe Lessee agrees not to use the Aircraft for any illegal purposes, including but not limited to:\nTransporting unlawful goods or materials (e.g., contraband, weapons, etc.);\nConducting unauthorized flights or operating in prohibited airspace;\nEngaging in illegal smuggling or trafficking activities.\nThe Aircraftshall be based at London Heathrow Airport, unless otherwise agreed in writing by the\nLessor. The Lessee shall notify the Lessor in writing before moving the Aircraft to any other\njurisdiction or country.\nModifications and Alterations:\nThe Lessee shall not make any material modifications, alterations, or improvements to the Aircraft\nwithout the prior written consent of the Lessor, except for routine repairs and replacementsthat are\nrequired for the Aircraft to remain airworthy and compliant with applicable regulations.\nAny approvedmodifications or upgradesto the Aircraft, including changesto the avionics, interior, or\nexterior, must be performed by a certified maintenance organization and comply with all regulatory\nrequirements. The Lessee agrees to bear the cost of such modifications.\nUpon termination of the Lease, the Lessee agreesto restore the Aircraft to its original configuration,\nunless otherwise agreed in writing by the Lessor.\nOperational Reporting:\nThe Lessee shall provide the Lessor with regular operational reports during the Lease Term,\nincluding:\nMonthly flight reports, detailing flight hours, cycles, and any incidents or maintenance issues;\nQuarterly maintenance reports, summarizing all maintenance activities and inspections performed\non the Aircraft;\nAnnual financialstatements, detailing any operational costs, including maintenance, fuel, crew\nsalaries, and other expenses incurred in operating the Aircraft.\nThe Lessee shall promptly notify the Lessor of any accidents, incidents, or mechanical failures\ninvolving the Aircraft and shall submit a written report detailing the nature and cause of the event,\nand the steps taken to rectify the situation.\n11\nTaxes and Fees:\nThe Lessee shall be solely responsible for paying all taxes, duties, fees, and other chargesimposed by\nany governmental authority in connection with the possession, use, or operation of the Aircraft,\nincluding but not limited to:\nSalestax, use tax, and excise tax on the Lease payments;\nAirport landing fees, navigation charges, and airport parking fees;\nAny customs duties or import/export feesin the event that the Aircraft is operated across\ninternational borders.\nThe Lessee agreesto indemnify and hold harmless the Lessor from any tax liabilities or penalties\narising from the Lessee’s failure to comply with its tax obligations.\nEnvironmental and Safety Compliance:\nThe Lessee agreesto comply with all applicable environmental laws and regulationsrelated to the\noperation of the Aircraft, including noise abatement procedures, emissionsstandards, and\nenvironmental impact assessments.\nThe Lessee shall not use or store any hazardous materials on board the Aircraft unlesssuch materials\nare necessary for the operation of the Aircraft and are handled in accordance with applicable safety\nregulations.\nThe Lessee shall ensure that all necessary safety equipment is on board the Aircraft and in good\nworking order, including but not limited to fire extinguishers, oxygen systems, life rafts, and\nemergency medical kits.\n12\nSECTION 9: MAINTENANCE OF AIRCRAFT\n1. Maintenance Schedule: The Lessee shall follow the Aircraft’s maintenance schedule as\nstipulated by the manufacturer, outlined in the table below:\nMaintenance Type Frequency Estimated Cost\n(USD)\nProvider Next Scheduled\nDate\nLine Maintenance Every 600 flight\nhours\n$30,000 [Provider\nName]\nFebruary 10,\n2025\nHeavy Maintenance Every 2.5 years $1,200,000 [Provider\nName]\nAugust 15, 2026\nEngine Overhaul Every 5,500 cycles $4,500,000 [Provider\nName]\nTBD based on\nusage\nAvionics Check Annual $120,000 [Provider\nName]\nNovember 20,\n2024\nLanding Gear\nOverhaul\nEvery 8 years $800,000 [Provider\nName]\nSeptember 1,\n2030\n2. Unscheduled Maintenance Costs: If any unscheduled maintenance isrequired, the Lessee is\nresponsible for covering these costs, as detailed below:\nComponent Type of Repair Estimated Cost(USD) Time to Repair\nEngine Minor damage $120,000 3 weeks\nLanding Gear Hydraulic issues $60,000 2 week\nAvionics Communication fault $20,000 4 days\n13\nSECTION 10: GENERAL TAX INDEMNITY\n1",
    "chunk_order_index": 2,
    "full_doc_id": "doc-b3a6e9bbeadb1ead45aa26dc71caade6"
  },
  "chunk-91c8c93a0da1ead29bcd8ff3ae4b420a": {
    "tokens": 1200,
    "content": "1,\n2030\n2. Unscheduled Maintenance Costs: If any unscheduled maintenance isrequired, the Lessee is\nresponsible for covering these costs, as detailed below:\nComponent Type of Repair Estimated Cost(USD) Time to Repair\nEngine Minor damage $120,000 3 weeks\nLanding Gear Hydraulic issues $60,000 2 week\nAvionics Communication fault $20,000 4 days\n13\nSECTION 10: GENERAL TAX INDEMNITY\n1. Tax Categories: The following table outlinesthe taxesthe Lessee isresponsible for during the\nlease term:\nTax Type Rate Payment\nFrequency\nJurisdiction Estimated Annual\nAmount (USD)\nSales Tax 6% on lease\npayments\nMonthly (on\nrent)\nState of Texas, USA $180,000\nProperty Tax 1.5% of aircraft\nvalue\nAnnually Harris County,\nTexas, USA\n$750,000\nInternational\nFees\nVaries by\nairport/country\nPer Use Various\n(International Ops)\n$150,000\n2. Tax Indemnity: The Lessee shall indemnify the Lessor for any tax liabilities not covered under\nthe terms of this agreement, as outlined below:\nScenario Tax Liability Responsible\nParty\nRemedy\nTax on sale or transfer of\nAircraft\n11% of aircraft value Lessor Lessor pays; Lessee\nindemnifies Lessor\nInternational customs\nduties\nVariable Lessee Lessee paysimmediately\nPenaltiesforlate tax\npayments\n6% per month of\nunpaid tax\nLessee Lessee pays penalties and\ninterest\n14\nSECTION11: CASUALTYOCCURRENCES\nDefinition of Casualty:\nA \"Casualty Occurrence\" shall refer to any event that causes significant physical damage to the\nAircraft, rendering it unfit for safe or legal operation, orresultsin the total destruction or irreparable\nloss of the Aircraft. Such events may include, but are not limited to:\nAccidents: Any event where the Aircraft isinvolved in a collision or other form of impact, either in\u0002flight or on the ground, resulting in structural or mechanical damage.\nHijacking or Unlawful Seizure: Any situation where the Aircraft is unlawfully taken or commandeered\nby individuals or groups, resulting in damage or operational impairment.\nFire, Explosion, or Natural Disaster: Eventssuch asfire, explosion, flooding, or any other natural\ndisaster that causes material damage to the Aircraft.\nActs of Terrorism or Sabotage: Any malicious act intended to cause damage to or destruction of the\nAircraft, including acts of terrorism, sabotage, or other criminal activity.\nWar or Hostile Acts: Any damage resulting from war, military action, or other hostile engagements,\nincluding but not limited to the Aircraft being shot down, bombed, or damaged by other forms of\ncombat.\nLessee’s Obligationsin the Event of a Casualty:\nIn the event of a Casualty Occurrence, the Lessee shall promptly undertake the following actions:\nImmediate Notification: The Lessee shall notify the Lessor in writing within 24 hours of the\noccurrence, providing an initial report with the details of the event, the extent of the damage, and\nany potential risks to the Aircraft. The Lessee must provide a comprehensive written report within\nfive business days of the occurrence, including all relevant facts, witness statements, technical\nevaluations, and initial assessments of the damage.\nPrevention of Further Damage: The Lessee must take all reasonable steps necessary to protect the\nAircraft from further damage or deterioration following the Casualty Occurrence. This includes\nsecuring the Aircraft, preventing unauthorized access, and arranging for the Aircraft to be\ntransported to a safe location, if necessary.\nCollaboration with Authorities: If the CasualtyOccurrence involves criminal activity (e.g., hijacking,\nterrorism) or regulatory breaches, the Lessee shall fully cooperate with law enforcement, aviation\nauthorities, and other relevant agencies. The Lessee shall also ensure that the Lessor is kept\ninformed of all communications with such authorities.\nRepair or Salvage Assessments: The Lessee shall arrange for immediate assessments of the damage\nby certified technicians, surveyors, or aviation engineers to determine whether the Aircraft can be\nrepaired or salvaged. A copy of all assessments, along with detailed repair or salvage plans, must be\nsubmitted to the Lessor for review and approval.\nTemporary Replacement: If the Aircraft is temporarily unfit for use but not a total loss, the Lessee\nmay, at its own cost, provide a temporary replacement aircraft (subject to the Lessor’s approval) until\nthe Aircraft is repaired or returned to service.\n15\nInsurance Proceedsin Case of Total Loss:\nIf the Aircraft is deemed a Total Loss, meaning it is destroyed, rendered permanently unfit for use, or\nthe cost of repair exceedsthe market value of the Aircraft, the following provisions shall apply:\nTotal Loss Declaration: The Aircraftshall be deemed a Total Lossif:\nThe Aircraft is destroyed or damaged beyond economical repair;\nIt is permanently lost or cannot be recovered (e.g., due to hijacking, unlawful seizure, or\ndisappearance);\nIt has been condemned as unfit for service by an aviation authority or other relevant regulatory\nbody.\nAssignment of Insurance Proceeds: In the event of a Total Loss, the Lessee shall assign all rights to\nthe insurance proceedsto the Lessor, asspecified in Section 12 (Insurance). The insurance proceeds\nshall include any amounts payable under the Hull All-Risk Insurance, War Risk Insurance, and other\nrelevant policies. The Lessee shall:\nNotify the insurance provider immediately of the Total Loss and ensure that all claims are submitted\nand processed in a timely manner;\nCooperate fully with the Lessor and the insurersto",
    "chunk_order_index": 3,
    "full_doc_id": "doc-b3a6e9bbeadb1ead45aa26dc71caade6"
  },
  "chunk-a6fbfbeebb0f45899c7f546721a88871": {
    "tokens": 1200,
    "content": "event of a Total Loss, the Lessee shall assign all rights to\nthe insurance proceedsto the Lessor, asspecified in Section 12 (Insurance). The insurance proceeds\nshall include any amounts payable under the Hull All-Risk Insurance, War Risk Insurance, and other\nrelevant policies. The Lessee shall:\nNotify the insurance provider immediately of the Total Loss and ensure that all claims are submitted\nand processed in a timely manner;\nCooperate fully with the Lessor and the insurersto facilitate the promptsettlement of claims;\nAssign all claims, payments, and recovery rightsto the Lessor.\nUse of Proceeds: The Lessor shall have sole discretion over the use of the insurance proceeds, which\nmay include:\nApplying the proceedsto settle any outstanding amounts owed by the Lessee under this Agreement;\nUtilizing the funds to repair or replace the Aircraft, if feasible;\nRetaining the proceedsin the event of termination of the Lease.\nTermination or Replacement in Case of Total Loss:\nUpon a CasualtyOccurrence resulting in a Total Loss, the following options may be exercised:\nTermination of the Agreement:\nThe Lessor shall have the right to terminate this Agreement upon written notice to the Lessee in the\nevent of a Total Loss. Upon termination, the Lessee shall promptly return any records, documents, or\nparts related to the Aircraft that were not destroyed in the Casualty Occurrence. The Lessee shall\nalso pay any outstanding amounts owed under this Agreement, including Rent, Additional Rent, or\nother fees accrued up to the date of termination.\nAny remaining insurance proceeds, after settlement of the Lessee’s obligations, shall be retained by\nthe Lessor.\nReplacement of the Aircraft (Subject to Lessor’s Consent):\n16\nIn lieu of termination, the Lessee may propose the replacement of the Aircraft with a similar aircraft\nof comparable value, age, and condition, subject to the Lessor’s prior written approval. The\nreplacement aircraft mustmeet the following criteria:\nIt must be of the same make, model, and configuration, or a model approved by the Lessor;\nIt must be in good working order, airworthy, and compliant with all applicable aviation regulations;\nThe replacement must be delivered to the Lessor within 90 days of the Casualty Occurrence, unless\notherwise agreed in writing.\nAll costs associated with the procurement, delivery, and registration of the replacement aircraftshall\nbe borne by the Lessee.\nIf the Lessor acceptsthe replacement aircraft, the terms of this Agreementshall continue, with the\nreplacement aircraft being subject to all the same terms and conditions applicable to the original\nAircraft.\nRestoration ofthe Aircraft:\nIn some cases where the Aircraft is not deemed a Total Loss, but requiressignificant repair, the\nLessee may elect to restore the Aircraft to its original condition, subject to the Lessor’s written\napproval of the repair plan. All costs of the restoration shall be borne by the Lessee.\nUpon completion of repairs, the Aircraftshall undergo a thorough inspection and certification\nprocess by a certified aviation authority before being returned to service.\nPartial Damage and Repairs:\nIn the event the Aircraft sustains damage but is not considered a Total Loss, the Lessee shall, at its\nown expense, arrange for the Aircraft to be promptly repaired and restored to the condition required\nunder this Agreement. Repairs must:\nBe carried out by a certified and approved maintenance organization, in accordance with the\nmanufacturer’s guidelines and all applicable regulatory requirements;\nBe completed within a reasonable time frame, as agreed upon by the Lessor and Lessee.\nDuring the repair period, the Lessee shall continue to pay Rent, Additional Rent, and all other fees\ndue under this Agreement, unless otherwise agreed by the Lessor.\n17\nSECTION 12: INSURANCE\n1. Types of Insurance:\nThe Lessee agrees to maintain, at its own expense, the following types of insurance for the\nAircraftthroughout the Lease Term. The insurance policies must be procured from insurance\ncompanies with an A.M. Best rating of at least A- or equivalent, and must provide coverage\nthat is consistent with industry standardsfor commercial aircraft operations.\no Hull All-Risk Insurance:\n Coverage must be equal to or exceed the full replacement value of the\nAircraft. This coverage shall protect against physical loss or damage to the\nAircraft arising from all risks of flight and ground operation, including but not\nlimited to accidents, fire, theft, vandalism, lightning, windstorm, and\ncollision.\n The policy must include provisionsfor partial damage and total loss of the\nAircraft, with any claims proceeds payable to the Lessor asthe loss payee.\no Third-Party Liability Insurance:\n The Lessee shall maintain third-party liability insurance with coverage limits\nof no less than $500 million per occurrence. This coverage must protect\nagainst legal liabilities arising from bodily injury, death, or property damage\ncaused to third parties in connection with the operation or use of the\nAircraft.\n The policy must include coverage for liabilities arising from ground handling\noperations, passenger-related claims, and damage caused to airport\nproperty or other aircraft.\no Passenger Liability Insurance:\n The Lessee must maintain passenger liability coverage that provides for\nbodily injury or death to passengers aboard the Aircraft, with a minimum\ncoverage of $100,000 per passenger, or as required by applicable law or\nregulations.\n This coveragemust extend to all operations, including domestic and\ninternational flights, and apply regardless of whether the claim arisesfrom\nan accident, incident, or other operational event.\no War Risk Insurance:\n The Lessee shall maintain war risk insurance to cover losses arising from war,\nterrorism, hijacking, sabotage, unlawful seizure of the Aircraft, and other\nwar-related perils.\n Coverage should include confiscation, seizure, or nationalization of the\nAircraft by government or military forces,",
    "chunk_order_index": 4,
    "full_doc_id": "doc-b3a6e9bbeadb1ead45aa26dc71caade6"
  },
  "chunk-46a54de32159184c97f22f931066a13c": {
    "tokens": 1200,
    "content": "coveragemust extend to all operations, including domestic and\ninternational flights, and apply regardless of whether the claim arisesfrom\nan accident, incident, or other operational event.\no War Risk Insurance:\n The Lessee shall maintain war risk insurance to cover losses arising from war,\nterrorism, hijacking, sabotage, unlawful seizure of the Aircraft, and other\nwar-related perils.\n Coverage should include confiscation, seizure, or nationalization of the\nAircraft by government or military forces, and the policy limits must be no\nless than $100 million or asspecified by the Lessor.\n The policy should also cover civil commotions, riots, and other violent\ndisturbances that may affect the Aircraft.\n18\no Crew Liability Insurance:\n The Lessee shall maintain insurance to cover any liability arising from claims\nmade by or on behalf of crew members of the Aircraft in relation to bodily\ninjury, death, or other personal harm. The minimum coverage shall be $50\nmillion per occurrence or as required by local labor laws and international\nregulations.\no Cargo and Baggage Liability Insurance:\n If the Aircraft is used for cargo operations, the Lessee must maintain cargo\nliability insurance covering any loss, damage, or destruction of cargo\ntransported on the Aircraft.\n The policy must provide for coverage limits consistent with the value of the\ncargo carried and comply with any applicable laws governing cargo liability.\n Coverage must also extend to personal baggage of passengers, with\nminimum coverage limits of $1,500 per passenger.\no Ground Risk Insurance:\n The Lessee must obtain ground risk insurance to cover the Aircraft when it is\nnot in motion (hangar, storage, etc.), including protection against theft, fire,\nand natural disasters.\n The policy must provide coverage for full replacement value or repair costsif\nthe Aircraft is damaged while grounded.\n2. Insurance Policies:\nAll insurance policiesrequired under this Agreement must include the following provisions:\no Lessor as Additional Insured and Loss Payee:\n The Lessor shall be named as an additional insured and loss payee under all\ninsurance policies, ensuring that the Lessor isfully protected in the event of\na claim or loss. Any claims proceeds under the Hull All-Risk, War Risk, or\nThird-Party Liability policiesshall be payable directly to the Lessor, or to the\nLessee and Lessor jointly.\n The policies shall specify that the Lessor’s rights and interests will not be\ninvalidated or diminished by any acts, omissions, or negligence on the part\nof the Lessee or its agents.\no Non-Cancellation Clause:\n Each insurance policy must include a 30-day prior written notice provision\nrequiring the insurer to notify the Lessor in writing at least 30 days before\nany cancellation, non-renewal, or material change in the terms or coverage\nof the policy.\n In cases where war risk coverage isreduced or cancelled due to an increase\nin hostilities or political unrest, the insurer must provide seven days’ notice\nto the Lessor, with the Lessee taking immediate steps to replace or restore\nthe required coverage.\n19\no Waiver of Subrogation:\n All policies must include a waiver ofsubrogation in favor of the Lessor,\nensuring that the insurers cannot seek reimbursement from the Lessor for\nany claims paid under the policy, even in cases where the Lessor isfound to\nhave contributed to the cause of loss or damage.\no Primary Insurance:\n The policies must be primary and non-contributory, meaning they take\nprecedence over any other insurance policies held by the Lessor or its\naffiliates. The policies shall cover the full amount of any claim without\nreduction by other insurance the Lessor may carry.\n3. Proof of Insurance:\nThe Lessee agrees to provide the Lessor with certificates of insurance and any other\ndocuments or evidence of insurance coverage asrequired by the Lessor. This must be done\nprior to the Delivery Date of the Aircraft and upon any renewal, replacement, or modification\nof the policies. Such proof must include:\no Certificates of Insurance:\n The Lessee shall deliver certificates of insurance issued by the insurance\ncompanies, confirming the types and amounts of coverage, naming the\nLessor as additional insured and loss payee, and confirming compliance with\nall other requirements outlined in this Agreement.\no Policy Endorsements:\n The Lessee shall provide copies of all endorsements, riders, and\namendments to the policies that may affect the Lessor’s rights or coverage.\nThis includes any modifications to coverage limits, cancellation clauses, and\nnamed insureds.\no Renewal Certificates:\n At least 30 days before the expiration of any insurance policy, the Lessee\nshall provide the Lessor with renewal certificates or proof of replacement\ncoverage ensuring no lapse in insurance protection.\no Notice of Claims:\n In the event of any loss, damage, or occurrence giving rise to a claim under\nthe insurance policies, the Lessee shall immediately notify the Lessor and\nthe insurersin writing, detailing the nature and extent of the claim. The\nLessee shall provide the Lessor with all information and documentation\nrequired to processthe claim and assist in pursuing any recovery from the\ninsurers.\n4. Failure to Maintain Insurance:\no If the Lessee failsto procure or maintain any of the required insurance coverage, the\nLessor may, at its option:\n20\n Procure such insurance on behalf of the Lessee and recover the cost from\nthe Lessee as Additional Rent; or\n Declare an event of default under this Agreement and exercise any remedies\navailable under Section 17.\no The Lessee shall indemnify and hold the Lessor harmless for any losses, damages, or\nliabilities incurred by the Lessor as a result of the",
    "chunk_order_index": 5,
    "full_doc_id": "doc-b3a6e9bbeadb1ead45aa26dc71caade6"
  },
  "chunk-87534371fbc9c7078581703b80e5101a": {
    "tokens": 1200,
    "content": "or maintain any of the required insurance coverage, the\nLessor may, at its option:\n20\n Procure such insurance on behalf of the Lessee and recover the cost from\nthe Lessee as Additional Rent; or\n Declare an event of default under this Agreement and exercise any remedies\navailable under Section 17.\no The Lessee shall indemnify and hold the Lessor harmless for any losses, damages, or\nliabilities incurred by the Lessor as a result of the Lessee’sfailure to maintain the\nrequired insurance coverage.\n21\nSECTION13: INDEMNIFICATION\n1. Lessee Indemnification: The Lessee agrees to indemnify and hold harmless the Lessor from\nany and all claims, liabilities, losses, or damages arising out of the Lessee’s use, possession,\nor operation of the Aircraft, except to the extent caused by the Lessor’s gross negligence or\nwillful misconduct.\n2. Lessor Indemnification: The Lessor agrees to indemnify and hold harmless the Lessee from\nany claims arising from the ownership of the Aircraft, except those arising from the Lessee’s\nuse or operation of the Aircraft.\nSECTION 14: LIENS\n1. Lessee’s Obligation: The Lessee shall not create, permit, or suffer any liens, charges, or\nencumbrances on the Aircraft, except for liensresulting from routine maintenance or repairs,\nwhich shall be promptly discharged.\n2. Lessor’s Rights: In the event of a lien, the Lessor reserves the right to require the Lessee to\npay any amounts necessary to release such liens within 30 days.\n22\nSECTION 15: PERFECTION OF TITLE AND FURTHER ASSURANCES\n• Title:\nThe Lessor retainsfull legal and beneficial title to the Aircraft during the Lease Term. The Lessee\nacknowledges that it has no right, title, or interest in the Aircraft other than the right to use it under\nthe terms of this Agreement.\nThe Lessee agrees not to attempt or facilitate any action that would challenge or impair the Lessor's\nownership rights, including but not limited to, any attempt to sell, transfer, pledge, mortgage, or\notherwise encumber the Aircraft.\nAny modifications, improvements, or additions made to the Aircraft by the Lessee during the Lease\nTerm shall immediately vest in the Lessor, unless otherwise agreed in writing.\n• Further Assurances:\nThe Lessee agreesto execute, acknowledge, and deliver all documents, instruments, and other forms\nof assurances asthe Lessor may reasonably request to ensure and maintain the Lessor’s ownership\nrights and interest in the Aircraft.\nThe Lessee shall cooperate with the Lessor to ensure the Aircraft is properly registered or\nderegistered with any relevant civil aviation authorities, including but not limited to the Federal\nAviation Administration (FAA), European Aviation Safety Agency (EASA), or any other jurisdiction in\nwhich the Aircraft operates.\nIf required, the Lessee shall assist in perfecting any liens, security interests, or other protective\ninstruments in favor of the Lessor or its financiers.\n• Registration of Interests:\nThe Lessee agreesto register the Aircraft in the name of the Lessor, where required, and promptly\nfile any necessary documents with the aviation authorities to perfect the Lessor’s interest in the\nAircraft.\nThe Lessee shall not change the registration of the Aircraft or attempt to register the Aircraft in its\nown name or any third party’s name without the express written consent of the Lessor.\nIf the Aircraft isrequired to be registered in a different jurisdiction due to operational reasons, the\nLessee shall promptly inform the Lessor and take any steps necessary to ensure the Lessor's\nownership and title are protected in such jurisdiction.\n• Protection of Lessor’s Rightsin Third-Party Claims:\nThe Lessee agreesto take all reasonable actionsto protect the Lessor’s ownership and security\ninterest in the Aircraft against third-party claims, including but not limited to:\nEnsuring that no liens, mortgages, charges, or encumbrances are registered or asserted against the\nAircraft, except those arising by law in connection with repairs or maintenance.\nPromptly notifying the Lessor if any such claims or liens are asserted and taking allsteps necessary to\nremove or contest them at its own expense.\n• Deregistration upon Lease Termination:\n23\nUpon the termination or expiration of the Lease Term, the Lessee shall promptly assist the Lessor\nwith any deregistration or re-registration procedures required by the relevant aviation authority to\nensure that the Aircraft is properly returned to the Lessor’s possession.\nThe Lessee shall execute and deliver a Deregistration Power of Attorney as detailed in Exhibit J,\nauthorizing the Lessor to take any actions necessary to deregister the Aircraft from the jurisdiction in\nwhich it was operated by the Lessee.\n• Exportation or Importation Requirements:\nIf the Aircraft needsto be exported or imported into another jurisdiction during the Lease Term, the\nLessee shall comply with all applicable export control and import regulations, including but not\nlimited to obtaining required permits, clearances, and licenses, at its own expense.\nThe Lessee agrees to provide the Lessor with documentation of compliance with all applicable\ncustoms, tax, and regulatory requirements associated with the export or import of the Aircraft.\n• Legal Filings:\nThe Lessee agreesto assist the Lessor in making any legal filings or registrations required by local or\ninternational law to protect the Lessor’s interest in the Aircraft. This includes filings under the Cape\nTown Convention or similar international agreements related to aircraft assets.\nIf the Lessor requires the filing of any financing statement, lien document, or otherforms of legal\nsecurity interest, the Lessee agrees to cooperate and ensure such filings are made in a timely\nmanner.\n• Lessee’s Covenants:\nThe Les",
    "chunk_order_index": 6,
    "full_doc_id": "doc-b3a6e9bbeadb1ead45aa26dc71caade6"
  },
  "chunk-13199e27347019080a0ec246f450b324": {
    "tokens": 1200,
    "content": "esto assist the Lessor in making any legal filings or registrations required by local or\ninternational law to protect the Lessor’s interest in the Aircraft. This includes filings under the Cape\nTown Convention or similar international agreements related to aircraft assets.\nIf the Lessor requires the filing of any financing statement, lien document, or otherforms of legal\nsecurity interest, the Lessee agrees to cooperate and ensure such filings are made in a timely\nmanner.\n• Lessee’s Covenants:\nThe Lessee covenants that it will not allow the Aircraft to become subject to any adverse legal\nprocess, including seizure, impoundment, or forfeiture due to the Lessee’s activities. In the event of\nany such action, the Lessee shall immediately notify the Lessor and take all necessary actionsto\nrelease the Aircraft.\nIf the Aircraft is impounded, seized, or detained by any government authority due to the actions or\nomissions of the Lessee, the Lessee agreesto indemnify the Lessor for any costs, losses, or damages\nincurred as a result and shall secure the release of the Aircraft at its own expense.\n24\nSECTION 16: RETURN OF AIRCRAFT AND RECORDS\n1. Aircraft Return Checklist: Upon the expiration or termination of the Lease, the Aircraft must\nmeet the following conditions for return:\nComponent Condition RequiredDocumentation Notes\nAirframe No major damage,\nroutine wear\nLast 2 years of maintenance\nlogs\nMaintenance logs must be\nup to date\nEngines Mid-life status, no\nmajor defects\nEngine overhaul records Engines must meet\nperformance criteria\nAvionics Fully functional Latestsoftware updates,\ncalibration records\nAvionicsshould be up-to\u0002date and calibrated\nInterior Normal wear and\ntear acceptable\nCabin refurbishment records Lessee responsible for\nmajor damage\nExterior Repainted, no\nstructural damage\nInspection and repaint\ncertificates\nPaint must be in good\ncondition\n2. Return Documentation: Along with the Aircraft, the Lessee must return the following\nrecords:\nDocument Description Required Format\nFlight Logs All flights during the lease period Digital and Hard\nCopy\nMaintenance Records Complete maintenance history during the\nLease Term\nDigital and Hard\nCopy\nCertificates of\nAirworthiness\nLatest issued by FAA and/or EASA Original Copy\nEngine Performance\nReports\nLast 5 engine performance cycles Digital Copy\nInsurance Policies Proof of all insurance coverage during the\nLease Term\nCertified Copy\n25\nSECTION17: EVENTS OFDEFAULT\n1. Default Events: The following shall constitute an event of default (each a “Default Event”)\nunder this Agreement:\no Failure to Pay Rent: The failure of the Lessee to pay any Rent, Additional Rent, or\nother amount payable under this Agreement within 10 business days of the due\ndate. This includes but is not limited to the Basic Rent, Maintenance Reserves,\ninsurance premiums, taxes, or any other paymentsrequired under this Agreement.\no Breach of Material Covenant: The failure of the Lessee to perform or comply with\nany material term, covenant, or obligation under this Agreement, including but not\nlimited to:\n Failure to maintain and operate the Aircraft in compliance with applicable\nlaws and regulations.\n Failure to obtain or maintain required insurance coverage as described in\nSection 12;\n Failure to maintain the Aircraft in accordance with Section 9 (Maintenance\nObligations);\n Any unauthorized modification, sale, sublease, or transfer of the Aircraft.\no Insolvency, Bankruptcy, or Liquidation:\n Insolvency: The Lessee becomes unable to pay its debts as they become due,\nenters into any voluntary or involuntary arrangement or composition with\ncreditors, or ceases to carry on business.\n Bankruptcy or Liquidation: The Lessee files for bankruptcy, is declared\nbankrupt, or issubjected to a winding-up or liquidation order by a court of\ncompetent jurisdiction. Thisincludesthe appointment of a trustee, receiver,\nor liquidator over any part of the Lessee’s assets or business.\n Dissolution or Reorganization: The Lessee engages in any corporate\ndissolution,reorganization, orrestructuring that adversely affectsthe\nLessor’srights under this Agreement, without prior written consent from the\nLessor.\no Cross-Default: Any default by the Lessee under any other lease, financing\narrangement, or agreement with the Lessor, or any affiliate of the Lessor, that has\nnot been remedied within the applicable cure period.\no Misrepresentation: Anymaterial representation or warranty made by the Lessee\nunder this Agreement proves to have been untrue or misleading in any material\nrespect when made, and such misrepresentation has not been corrected within 30\ndays of notice from the Lessor.\no Unauthorized Alterations or Transfers: The Lessee makes any unauthorized\nmodification, transfer, orsublease of the Aircraft or assigns any rights underthis\nAgreement without prior written consent from the Lessor.\n26\no Regulatory Violations: The Aircraft is grounded or detained by aviation authorities\ndue to regulatory violations or Lessee’s failure to comply with applicable aviation\nsafety, registration, or operational requirements.\n2. Cure Period for Payment Defaults:\nIn the event that the Lessee fails to make a payment of Rent, Additional Rent, or any other sum due\nunder this Agreement within the time frame specified in Section 17.1, the Lessee shall have a period\nof 10 business days from the date the payment is due to cure such default. If the Lessee failsto cure\nthe payment default within this 10-day cure period, the Lessor may declare an event of default and\nexercise its remedies under Section 18.\n Late Payment Penalties: In addition to the obligation to cure the default within 10 days, the\nLessee",
    "chunk_order_index": 7,
    "full_doc_id": "doc-b3a6e9bbeadb1ead45aa26dc71caade6"
  },
  "chunk-dd80e291c78bacbc31944e707a9670e6": {
    "tokens": 1200,
    "content": "Agreement within the time frame specified in Section 17.1, the Lessee shall have a period\nof 10 business days from the date the payment is due to cure such default. If the Lessee failsto cure\nthe payment default within this 10-day cure period, the Lessor may declare an event of default and\nexercise its remedies under Section 18.\n Late Payment Penalties: In addition to the obligation to cure the default within 10 days, the\nLessee shall pay a late payment penalty of 2% of the overdue amount for each day the\npayment remains unpaid beyond the due date.\n3. Cure Period forNon-Payment Defaults:\nIn the case of any non-payment default (such as breach of any covenant, obligation, or\nrepresentation), the Lessee shall have a 30-day cure period to remedy the breach. The Lessee must:\n Provide the Lessor with written notice of the steps being taken to cure the breach within 10\nbusiness days of receiving notice from the Lessor of the default.\n Fully remedy the breach within 30 days of receiving notice from the Lessor. If the breach\ncannot be remedied within the 30-day period due to its nature, the Lessee shall demonstrate\nthat it has commenced a cure and provide a reasonable timeline for completion, subject to\nLessor’s approval.\n4. No Cure Period for Certain Events:\nNo cure period shall be applicable for the following Default Events:\n Insolvency, Bankruptcy, or Liquidation: In the event the Lessee files for bankruptcy or\ninsolvency, or is the subject of any winding-up or liquidation proceeding, there shall be no\ncure period, and the Lessor shall be entitled to immediately terminate this Agreement and\nrepossess the Aircraft.\n Abandonment of Aircraft: If the Lessee abandons or fails to take reasonable measures to\nsecure the Aircraft, there shall be no cure period, and the Lessor may immediately repossess\nthe Aircraft.\n27\nSECTION 18: REMEDIES\nIf the Lessee failsto cure any default within the applicable cure period, the Lessor may exercise any\nor all of the following remedies:\n Terminate the Agreement: The Lessor may terminate this Agreement by giving written\nnotice to the Lessee, upon which the Lease shall immediately terminate.\n Repossessthe Aircraft: The Lessor may take possession of the Aircraft wherever located,\nwith or without legal process, and for that purpose, may enter any premises where the\nAircraft may be located.\n Acceleration of Payments: The Lessor may declare all outstanding Rent and Additional Rent\ndue for the remaining term of the Lease immediately payable by the Lessee.\n Claim Damages: The Lessor may seek damagesfor any lossesincurred due to the Lessee’s\ndefault, including any costsrelated to repossessing, repairing, or re-leasing the Aircraft.\n Set-Off Rights: The Lessor may exercise its right of set-off against any security deposits,\nmaintenance reserves, or other amounts held by the Lessor to satisfy any obligations owed\nby the Lessee.\n Legal Action: The Lessor may initiate legal proceedingsto enforce its rights under this\nAgreement and recover any damages or unpaid amounts due.\n28\nSECTION19: ALIENATION\n1. Assignment by Lessor: The Lessor may assign its rights and obligations under this Agreement\nto a third party, provided that the assignee agreesto assume all of the Lessor's obligations.\n2. Assignment by Lessee: The Lessee may not assign or sublease the Aircraft without the prior\nwritten consent of the Lessor.\nSECTION 20: MISCELLANEOUS\n1. Governing Law: This Agreementshall be governed by and construed in accordance with the\nlaws of the State of New York.\n2. Dispute Resolution: Any disputes arising out of or related to this Agreement shall be\nresolved through arbitration in accordance with the rules of the American Arbitration\nAssociation, with arbitration to be held in New York City.\n3. Entire Agreement: This Agreement constitutesthe entire agreement between the parties\nand supersedes any prior agreements or understandings.\nSIGNATURES\nLESSOR: AeroSky Rentals Ltd.\nName: Emily Johnson\nTitle: Chief Financial Officer\nDate: August 10, 2025\nLESSEE: BlueJet Airways Corp.\nName: Michael Brown\nTitle: Vice President of Operations\nDate: August 10, 2025\nA1\nExhibit A\nAircraft Specifications\n1. AIRFRAME\nManufacturer: AirWorks Aviation\nType and Model: AWX-900\nSerial Number: 98765\nMaximum Take Off Weight (MTOW): 85,000 KGS\nMaximum Landing Weight (MLW): 70,500 KGS\nMaximum Zero Fuel Weight (MZFW): 66,500 KGS\n2. ENGINES\nEngine Manufacturer: Pratt & Whitney\nType and Model: PW1100G\nSerial Numbers: 1234 and 5678\n3. APU (Auxiliary Power Unit)\nManufacturer: TAE Aerospace\nType and Model: AP-1000\nSerial Number: APU-54321\n4. LANDING GEAR\nManufacturer: Messier-Bugatti-Dowty\nType and Model: Position P/N S/N\n NLG (Nose Landing Gear): LG-98765-0001 | 15N12345\n LH MLG (Left Hand Main Landing Gear): LG-87654-0001 | 15LH5432\n RH MLG (Right Hand Main Landing Gear): LG-76543-0001 | 15RH6789\n5. AIRCRAFT DOCUMENTS\nA. Certificates\nB. Maintenance Manuals on Boeing Toolbox\nA2\nC. Airworthiness Directives(",
    "chunk_order_index": 8,
    "full_doc_id": "doc-b3a6e9bbeadb1ead45aa26dc71caade6"
  },
  "chunk-d6fed4081306edcbe07540789a7af75c": {
    "tokens": 1200,
    "content": "(Nose Landing Gear): LG-98765-0001 | 15N12345\n LH MLG (Left Hand Main Landing Gear): LG-87654-0001 | 15LH5432\n RH MLG (Right Hand Main Landing Gear): LG-76543-0001 | 15RH6789\n5. AIRCRAFT DOCUMENTS\nA. Certificates\nB. Maintenance Manuals on Boeing Toolbox\nA2\nC. Airworthiness Directives(AD) Documentation\nD. Engineering Documentation\nE. Aircraft Maintenance Status Summaries\nF.AircraftMaintenance Records\nG. Configuration Status\nH. AircraftHistorical Records\nI. Engine Records\nJ. APU Records\nB1\nExhibit B\nList of Manuals, Documents and Records\nAircraft Maintenance Manual (AMM)\nVersion: AMM 2025-01\nLast Updated: December 10, 2024\nLocation: Stored in both physical and digital formats at the Lessee’s Maintenance Facility.\nFlight Crew Operating Manual (FCOM)\nEdition: FCOM v11.0\nIssue Date: February 5, 2025\nLocation: Onboard the aircraft and at Lessee’s Headquarters.\nMinimum Equipment List(MEL)\nRevision: MEL 01/2025\nEffective Date: January 15, 2025\nLocation: Available in the cockpit and with Lessee’s Maintenance Control Center.\nAircraft Logbook\nSerial Number: LOG98765-432\nDate of Last Entry: January 20, 2025\nLocation: Onboard the aircraft, retained in accordance with aviation regulations.\nAirworthiness Certificate\nCertificate Number: AWC-12345\nIssuance Date: April 15, 2023\nExpiration Date: April 15, 2026\nLocation: Onboard the aircraft, and a copy filed with the Lessee’s Compliance Department.\nLease Agreement\nReferenceNumber: Lease-ASR-BJA-2025-01\nEffective Date: August 10, 2025\nLocation: Stored at both Lessor’s office and Lessee’slegal department in Toronto.\nWeight and Balance Manual\nVersion: WB-2025-02\nLast Updated: February 1, 2025\nLocation: Onboard the aircraft and accessible via Lessee’s Engineering Department.\nCertificate of Insurance\nPolicy Number: CI-12345-BJA\nEffective Period: August 1, 2025 – July 31, 2026\nInsurer: Global Aviation Insurance Co.\nLocation: Filed with the Lessee’s Risk Management Office.\nAircraft Delivery and Acceptance Record\nDocument ID: DA-2025-900-01\nAcceptance Date: August 10, 2025\nLocation: Stored with Lessor and Lessee’s Aircraft Leasing Department.\nDamage History Report\nReport Number: DHR-54321-2024\nB2\nLast Entry: No major incidents or damages as of January 1, 2025\nLocation: Filed with the Lessee’s Aircraft Maintenance Records.\nC1\nExhibit C\nDefinitions and Values\nAircraft\nDefinition: The term “Aircraft” refersto the SkyLiner A350, having the manufacturer's serial number\n2098745 and registration number G12345, including engines, avionics, components, and all\nassociated equipment.\nValue: $70,000,000 (current market value).\nBasic Rent\nDefinition: “Basic Rent” refersto the fixed monthly payment the Lessee agreesto pay the Lessor for\nthe lease of the Aircraft.\nValue: $180,000 per month.\nLease Term\nDefinition: “Lease Term” refersto the period during which the Lessee is entitled to use and operate\nthe Aircraft, subject to the terms and conditions of this Agreement.\nValue: 60 months(5 years), commencing on August 1, 2025, and expiring on August 1, 2030.\nSecurity Deposit\nDefinition: “Security Deposit” refersto the sum paid by the Lessee to the Lessor as a form of financial\nguarantee for the performance of obligations under the Lease Agreement.\nValue: $600,000, to be paid prior to the Aircraft’s delivery.\nMaintenance Reserve Payments\nDefinition: “Maintenance Reserve Payments” refersto the monthly payments made by the Lessee to\nthe Lessor to cover future maintenance and overhaul costs.\nValue: $40,000 per month, paid in addition to Basic Rent.\nDelivery Date\nDefinition: “Delivery Date” refersto the date on which the Aircraft is physically delivered to the\nLessee by the Lessor and all delivery conditions are satisfied.\nValue: Expected delivery on August 1, 2025.\nReturn Condition\nDefinition: “Return Condition” refersto the condition the Aircraft must be in when returned by the\nLessee to the Lessor at the end of the Lease Term, as specified in this Agreement.\nValue: The Aircraft must be returned in a fully airworthy condition, meeting all regulatory\nrequirements.\nInsurance Coverage\nDefinition: “Insurance Coverage” refersto the required insurance policiesthe Lessee must maintain\nfor the Aircraft, including hull, third-party liability, and war risk coverage.\nValue: Hull insurance to cover up to $70,000,000, and third-party liability of no less than\n$150,000,000.\nUtilization Rate\nDefinition: “Utilization Rate” refersto the allowed usage of the Aircraft during the Lease Term,\nC2\ntypically expressed in flight hours or cycles.\nValue: 5,000 flight hours or 2,500 cycles per year.\nLate PaymentInterest\nDefinition: “Late Payment Interest” refersto the penalty interest the Lessee must pay in the event of\nlate payments of Rent or other sums due under the Agreement.\nValue: 6% per annum on the overdue amount, calculated daily.\nD1\nExhibit D\nMaintenance Payment",
    "chunk_order_index": 9,
    "full_doc_id": "doc-b3a6e9bbeadb1ead45aa26dc71caade6"
  },
  "chunk-3a5fd9636fca2d2f7358ba261285d7c2": {
    "tokens": 1200,
    "content": "allowed usage of the Aircraft during the Lease Term,\nC2\ntypically expressed in flight hours or cycles.\nValue: 5,000 flight hours or 2,500 cycles per year.\nLate PaymentInterest\nDefinition: “Late Payment Interest” refersto the penalty interest the Lessee must pay in the event of\nlate payments of Rent or other sums due under the Agreement.\nValue: 6% per annum on the overdue amount, calculated daily.\nD1\nExhibit D\nMaintenance Payment Provisions\nScheduled Maintenance\nProvision: The Lessee shall be responsible for all costs related to routine scheduled maintenance of\nthe Aircraft during the Lease Term, including inspections, repairs, and replacements of parts.\nPayment Frequency: Monthly, along with Basic Rent.\nAmount: $45,000 per month as part of the Maintenance Reserve Payments.\nUnscheduled Maintenance\nProvision: The Lessee shall bear the costs for any unscheduled maintenance,repairs, or\nreplacements that arise due to wear and tear, defects, or operational incidents. The Lessee shall\npromptly notify the Lessor of any significant issues that affect the airworthiness of the Aircraft.\nPayment Due: Within 30 days of invoice from the maintenance provider or upon reimbursement\nrequest by the Lessor.\nAmount: Variable, based on actual repair costs.\nEngine Overhaul Reserves\nProvision: The Lessee shall make monthly paymentsinto an Engine Overhaul Reserve fund to cover\nfuture costs of engine overhauls. The Lessor may draw from this reserve when major overhauls are\nrequired.\nPayment Frequency:Monthly.\nAmount: $15,000 per engine per month.\nAirframe Heavy Maintenance Reserves\nProvision: The Lessee shall contribute to an Airframe Heavy Maintenance Reserve to account for\ncosts related to major structural inspections and overhauls.\nPayment Frequency:Monthly.\nAmount: $10,000 per month.\nLanding Gear Overhaul Reserves\nProvision: The Lessee shall be required to makemonthly paymentsto a reserve fund specifically for\nlanding gear overhauls.\nPayment Frequency:Monthly.\nAmount: $5,000 per month.\nReturn Condition Maintenance\nProvision: Upon the expiration or early termination of the Lease, the Lessee shall be responsible for\nensuring that the Aircraft is returned to the Lessor in the condition outlined in the Return Condition\nclause, including performing any necessary maintenance.\nPayment Due: Prior to the return of the Aircraft, with any additional costs billed within 30 days after\nthe return inspection.\nAmount: Variable, based on the actual costsincurred to meet return condition standards.\nD2\nMaintenance Audits\nProvision: The Lessor shall have the right to audit the Lessee’s maintenance operations and records\nat any time, to ensure compliance with this Agreement. If the Lessee is found non-compliant, the\nLessor may demand immediate corrective actions and seek reimbursement for any associated costs.\nPayment Due: For costs arising from non-compliance, payment is due within 30 days of Lessor’s\nnotice.\nAmount: Variable, based on the audit findings.\nDeferred Maintenance\nProvision: Any maintenance deferred by the Lessee beyond recommended timeframes must be\napproved by the Lessor. In the event of deferred maintenance, the Lessor may require additional\npayments or reservesto cover any increased risk or costs.\nPayment Due: Upon approval of deferred maintenance or as agreed in the deferral terms.\nAmount: Determined based on the deferral period and estimated impact.\nMaintenance Payment Adjustments\nProvision: The Lessor reserves the right to adjust maintenance reserve payments every 12 months\nbased on actual maintenance costs and industry standard rates. The Lessee shall be notified of any\nadjustments at least 60 days prior to the change taking effect.\nAdjustment Rate: Not to exceed a 10% increase annually unless mutually agreed by both parties.\nReimbursement for Maintenance\nProvision: If the Lessee performs any major maintenance or overhaul that falls under the Lessor's\nresponsibility or if the Lessor agrees to cover certainmaintenance costs, the Lessee shall be\nreimbursed.\nPayment Due: Reimbursement will be made within 60 days of receipt of the invoice and supporting\ndocumentation.\nAmount: Variable, based on approved maintenance costs.\nE1\nExhibit E\nDelivery Conditions\nAircraft Condition at Delivery\nProvision: The Aircraft shall be delivered to the Lessee in an airworthy condition, fully equipped with\nall necessary parts, components, and avionics, as required by regulatory authorities. The Aircraft\nshall be in compliance with all applicable airworthiness directives, service bulletins, and maintenance\nrequirements as of the Delivery Date.\nLocation: Aircraftshall be delivered at Shannon Airport, Ireland.\nCondition: Free from any defects that would impair its use for commercial operations.\nCertification and Documentation\nProvision: At the time of delivery, the Lessor shall provide the Lessee with all necessary certificates,\ndocuments, and records, including but not limited to:\nCertificate of Airworthiness\nAircraft Registration Certificate\nMaintenance and Service Records\nWeight and Balance Records\nDamage History Report (if any).\nVerification: All documents must be up-to-date and verified by both parties prior to delivery.\nAircraftInspection\nProvision: Prior to acceptance, the Lessee shall have the right to conduct a pre-delivery inspection of\nthe Aircraft, including a review of all records and a physical inspection by itstechnical team or a\nthird-party expert.\nInspection Period: 5 business days prior to the scheduled Delivery Date.\nNon-Compliance: If the Aircraft does not meet the agreed delivery conditions, the Lessee may refuse\nacceptance until necessary repairs or adjustments are made.\nPaint and Livery\nProvision: The Aircraftshall be delivered in the Lessor’sstandard livery or as otherwise specified in\nExhibit C of this Agreement. The Lessee may request custom paint or branding at its own expense,\nwith the Lessor’s prior approval.\nCustomization",
    "chunk_order_index": 10,
    "full_doc_id": "doc-b3a6e9bbeadb1ead45aa26dc71caade6"
  },
  "chunk-93de19303996b783b2f92204c959d9fc": {
    "tokens": 1200,
    "content": "Period: 5 business days prior to the scheduled Delivery Date.\nNon-Compliance: If the Aircraft does not meet the agreed delivery conditions, the Lessee may refuse\nacceptance until necessary repairs or adjustments are made.\nPaint and Livery\nProvision: The Aircraftshall be delivered in the Lessor’sstandard livery or as otherwise specified in\nExhibit C of this Agreement. The Lessee may request custom paint or branding at its own expense,\nwith the Lessor’s prior approval.\nCustomization Deadline: Requestsfor custom paint must be made no later than 30 days prior to the\nDelivery Date.\nEngines and Components\nProvision: The Aircraftshall be delivered with engines and major componentsthat are in compliance\nwith the original equipment manufacturer’s (OEM) specifications and within the following\noperational limits:\nEngine Time Since Overhaul (TSO): Lessthan 2,000 hours\nLanding Gear Cycles: Less than 1,000 cycles\nAvionics and systemsfully operational.\nE2\nD2\nReplacement: Any component not meeting these standards must be replaced or overhauled by the\nLessor before delivery.\nFuel and Fluids\nProvision: The Aircraftshall be delivered with sufficient fuel and hydraulic fluids necessary for the\ndelivery flight to the Lessee’s designated location.\nAmount: Minimum fuel required for ferry flight, unless otherwise agreed upon by both parties.\nTest Flight and Acceptance\nProvision: The Lessee shall have the option to conduct or observe a test flight to ensure the Aircraft's\nperformance and compliance with all technical requirements. Any deficiencies noted during the test\nflightshall be corrected prior to final acceptance.\nTest Flight Window: To be scheduled within 48 hours prior to the Delivery Date.\nDelivery Date\nProvision: The Delivery Date shall be August 10, 2025, unless otherwise mutually agreed in writing.\nAny delays caused by the Lessor in delivering the Aircraft may result in penalties, including rent\ncredits or an extension of the Lease Term.\nLocation: Delivery shall take place at Shannon Airport, Ireland, unless a different delivery location is\nagreed upon by both parties.\nTitle Transfer\nProvision: Upon delivery, and subject to Lessee’s acceptance of the Aircraft, all necessary paperwork\nto transfer the operational control of the Aircraftshall be completed. Title to the Aircraft remains\nwith the Lessor, and the Lessee will hold a right to use and operate the Aircraft asspecified in this\nAgreement.\nEffectivity: Transfer of operational controlshall be deemed effective as of the Delivery Date.\nDelivery Delays\nProvision: If delivery of the Aircraft is delayed due to reasons attributable to the Lessor (e.g.,\nmechanical issues, missing documents), the Lessee shall be entitled to remedies, including:\nA daily penalty of $3,000 for each day of delay beyond the agreed Delivery Date.\nRent commencement deferral until the Aircraft is delivered in acceptable condition.\nForce Majeure: Delays caused by events beyond the control of either party (e.g., natural disasters,\ngovernmental restrictions) shall not incur penalties.\nF1\n2D\n2\nExhibit F\nReturn Conditions\nAircraft Condition at Return\nProvision: The Aircraft must be returned to the Lessor in an airworthy condition, free of any liens,\nand in a state suitable for immediate commercial operation, in accordance with the standards of the\naviation authorities governing its operation.\nCondition: The Aircraftshall be in the same configuration as delivered, subject to normal wear and\ntear. All components, including engines, avionics, landing gear, and interiors, must be operational and\nmeet OEM specifications.\nAirframe and Engine Hours/Cycles\nProvision: The Aircraftshall be returned with no more than the following remaining operating limits:\nAirframe: Lessthan 15,000 hourssince last heavy maintenance check.\nEngines: Each engine shall have at least 1,500 flight hours or 750 cyclesremaining before the next\nmajor overhaul isrequired.\nLanding Gear: At least 1,000 cyclesremaining before the next overhaul.\nInterior Condition\nProvision: The interior of the Aircraft shall be in good condition, clean, and free from any damage\nbeyond normal wear and tear. Seats, flooring, lavatories, and other cabin components must be fully\nfunctional and meet commercial passenger standards.\nRepairs: Any damage to the interior (e.g., torn seats, broken panels) must be repaired at the Lessee’s\nexpense before return.\nMaintenance Compliance\nProvision: All scheduled maintenance due during the Lease Term must be completed before the\nAircraft is returned, with no overdue items or deferred maintenance tasks outstanding. The Aircraft\nmust comply with all airworthiness directives (ADs) and service bulletins(SBs) issued by the relevant\naviation authorities.\nDocuments: The Lessee must provide complete maintenance recordsfor the Aircraft, engines, and\ncomponents, including proof of compliance with all applicable ADs and SBs.\nPaint and Livery\nProvision: The Aircraftshall be returned either in the Lessee’slivery (if approved by the Lessor) or\nrepainted in a neutral color agreed upon by both parties. Any custom branding applied during the\nLease Term must be removed prior to return at the Lessee’s cost.\nCondition: The paint must be free of significant defects (e.g., peeling, chipping) and suitable for\ncontinued commercial service.\nEquipment and Configuration\nProvision: The Aircraftmust be returned with all original equipment and configuration as at the time\nof delivery, including but not limited to:\nAvionicssystems\nF2\nE2\nD2\nSeats and interior components\nOperationalsafety equipment (e.g., oxygenmasks, life vests).\nMissing Items: Any missing equipment or components must be replaced by the Lessee at its own\nexpense prior to return.\nEngine and Component Condition\nProvision: All major components, including engines, APU, and landing",
    "chunk_order_index": 11,
    "full_doc_id": "doc-b3a6e9bbeadb1ead45aa26dc71caade6"
  },
  "chunk-8a0fa8ca3ef7d23089e96317c697b997": {
    "tokens": 1200,
    "content": "be returned with all original equipment and configuration as at the time\nof delivery, including but not limited to:\nAvionicssystems\nF2\nE2\nD2\nSeats and interior components\nOperationalsafety equipment (e.g., oxygenmasks, life vests).\nMissing Items: Any missing equipment or components must be replaced by the Lessee at its own\nexpense prior to return.\nEngine and Component Condition\nProvision: All major components, including engines, APU, and landing gear, shall be within the\noperational limitsspecified by the OEM. The engines must be in good operating condition, with no\nmajor repairsrequired for at least 1,500 hours or 750 cycles. The Aircraft must be returned with no\nengine or APU exceeding 10% of its allowable time between overhaul (TBO).\nReplacement: If any components are beyond the allowed operational limits, the Lessee must replace\nthem with parts of equal or better value before returning the Aircraft.\nFuel and Fluids\nProvision: The Aircraftshall be returned with a minimum fuel quantity sufficient for the ferry flight to\nthe agreed return location. All necessary hydraulic, oil, and other fluids must be at operational levels.\nLocation: The Aircraft shall be returned to the Lessor’s designated location, which shall be agreed\nupon in writing.\nTest Flight and Inspection\nProvision: The Lessor shall have the right to conduct or observe a post-return test flight to verify the\ncondition of the Aircraft. The cost of the test flight shall be borne by the Lessor unless any defects or\nissues are discovered during the test flight, in which case the Lessee shall bear the cost of repairs and\nthe flight.\nInspection: A comprehensive physical and recordsinspection will be conducted by the Lessor or an\nindependent third-party inspector prior to acceptance of the returned Aircraft.\nReturn Delays and Penalties\nProvision: If the Lessee fails to return the Aircraft by the expiration of the Lease Term, the Lessee\nshall pay a daily penalty for each day the Aircraft is overdue, unless mutually agreed upon in writing.\nPenalty Rate: $12,000 per day.\nGrace Period: A grace period of 5 days may be granted by the Lessor, provided there is a justifiable\ncause for the delay.\nFinal Acceptance and Title Transfer\nProvision:Upon satisfactory inspection and acceptance of the Aircraft by the Lessor, the Lessee shall\nprovide all necessary documentsfor the transfer of operational control back to the Lessor. The\nLessee will be released from any further obligations under the Agreement upon the Lessor’s written\nconfirmation of acceptance.\nG1\n2E\n2D\n2\nExhibit G\nLease Supplement No. 1\nThis Lease Supplement No. 1 (“Supplement”) is executed pursuant to the Aircraft Lease Agreement\ndated August 10, 2025, between AeroSky Rentals Ltd. (\"Lessor\") and BlueJet Airways Corp.\n(\"Lessee\"). The purpose of this Supplement isto provide additional terms and conditionsfor the\nlease of one (1) SkyLiner A350 aircraft bearing Manufacturer’s Serial Number 2098745 and\nRegistration Number G12345, and to modify certain provisions of the original Lease Agreement as\noutlined below.\n1. Identification of Aircraft: The Aircraft subject to this Lease Supplement is a SkyLiner A350,\nequipped with two (2) Rolls-Royce Trent XWB engines. The Aircraft has been inspected and\ndetermined to be in airworthy condition as of the Delivery Date specified in this Supplement.\nThe Lessee agrees to lease this specific aircraft in accordance with the terms of the original\nLease Agreement and the modifications set forth herein.\n2. Modification of Rent Payment: In addition to the Basic Rentspecified in the Lease\nAgreement, the parties agree that an additional maintenance reserve payment of $45,000\nper month shall be made by the Lessee, commencing on the first day of the month following\nthe Delivery Date. This payment shall be made to cover future maintenance costs related to\nthe Aircraft's engines, airframe, and major components.\n3. Lease Term and Extension: The Lease Term for the Aircraft identified in this Supplementshall\nbe 60 months, beginning on August 10, 2025, and ending on August 10, 2029. The Lessee\nshall have the option to extend the Lease Term for an additional 12 months, provided that\nwritten notice is given to the Lessor no later than 90 days before the expiration of the\noriginal Lease Term. Any extension of the Lease Term shall be subject to mutually agreed\nterms and conditions.\n4. Additional Terms: The provisions of this Lease Supplementshall be deemed to modify and\nsupplement the terms of the original Lease Agreement. In the event of any inconsistency\nbetween the terms of this Supplement and the Lease Agreement, the terms of this\nSupplement shall prevail. All other provisions of the Lease Agreement remain in full force\nand effect, and the parties hereby confirm their continued agreement to be bound by its\nterms.\nH1\nExhibit H\nCertificate of Delivery Technical Acceptance\nThis Certificate of Delivery Technical Acceptance (\"Certificate\") is executed on this 10th day of August\n2025, by and between AeroSky Rentals Ltd., a company organized under the laws of Canada\n(\"Lessor\"), and BlueJet Airways Corp., a company organized under the laws of the United Kingdom\n(\"Lessee\"), pursuant to the Aircraft Lease Agreement dated August 10, 2025.\n1. Aircraft Identification and Delivery:\nThe Aircraft being delivered under this Certificate is a SkyLiner A350, bearing Manufacturer’s\nSerial Number 2098745 and Registration Number G12345, and equipped with two (2) Rolls\u0002Royce Trent XWB engines. The Aircraft has been inspected and meets the specifications set\nforth in the Lease Agreement. The Aircraft is delivered by",
    "chunk_order_index": 12,
    "full_doc_id": "doc-b3a6e9bbeadb1ead45aa26dc71caade6"
  },
  "chunk-126b8729a96f5230bcdd0afbc6faa094": {
    "tokens": 1200,
    "content": "the United Kingdom\n(\"Lessee\"), pursuant to the Aircraft Lease Agreement dated August 10, 2025.\n1. Aircraft Identification and Delivery:\nThe Aircraft being delivered under this Certificate is a SkyLiner A350, bearing Manufacturer’s\nSerial Number 2098745 and Registration Number G12345, and equipped with two (2) Rolls\u0002Royce Trent XWB engines. The Aircraft has been inspected and meets the specifications set\nforth in the Lease Agreement. The Aircraft is delivered by the Lessor and accepted by the\nLessee at Toronto Pearson International Airport, Canada, on this date.\n2. Technical Inspection and Acceptance:\nThe Lessee has conducted a thorough technical inspection of the Aircraft, including a review\nof the maintenance records, operational performance, and compliance with airworthiness\ndirectives. Based on this inspection, the Lessee confirms that the Aircraft is in airworthy\ncondition and meets the delivery conditions specified in the Lease Agreement. All systems,\ncomponents, and avionics are functional, and no significant defects were identified during\nthe inspection process.\n3. Certification of Compliance:\nThe Aircraft is certified as compliant with the applicable regulations and airworthiness\nstandards of the Transport Canada Civil Aviation (TCCA) and the Federal Aviation\nAdministration (FAA). The Lessee acknowledges receipt of all relevant documents, including\nthe Certificate of Airworthiness, maintenance logs, service bulletins, and inspection records.\nThe Aircraft is delivered with no outstanding airworthiness directives or deferred\nmaintenance items.\n4. Acceptance by Lessee:\nThe Lessee hereby acknowledges and accepts delivery of the Aircraft in accordance with the\nterms of the Lease Agreement. By signing this Certificate, the Lessee confirms that the\nAircraft is in satisfactory condition for commercial operations and that all technical\nconditions of the Lease have been met. This Certificate shall serve as evidence of the formal\ndelivery of the Aircraft to the Lessee, effective as of August 10, 2025.\nLESSOR: AeroSky Rentals Ltd.\nName: Emily Johnson\nTitle: Chief Financial Officer\nDate: August 10, 2025\nLESSEE: BlueJet Airways Corp.\nName: Michael Brown\nTitle: Vice President of Operations\nDate: August 10, 2025\nI1\nExhibit I\nCertificate of Redelivery Technical Acceptance\nThis Certificate of Redelivery Technical Acceptance (\"Certificate\") is executed on this 10th day of\nAugust 2025, by and between AeroSky Rentals Ltd., a company organized under the laws of Canada\n(\"Lessor\"), and BlueJet Airways Corp., a company organized under the laws of the United Kingdom\n(\"Lessee\"), pursuant to the Aircraft Lease Agreement dated August 10, 2025.\n1. AircraftIdentification and Redelivery:\nThe Aircraft subject to redelivery under this Certificate is a SkyLiner A350, bearing\nManufacturer’s Serial Number 2098745 and Registration Number G12345, and equipped\nwith two (2) Rolls-Royce Trent XWB engines. The Aircraft has been inspected and returned by\nthe Lessee to the Lessor at Toronto Pearson International Airport, Canada, in accordance\nwith the redelivery termsspecified in the Lease Agreement.\n2. Technical Inspection and Redelivery Conditions:\nThe Lessee has conducted all necessary maintenance, repairs, and inspections prior to\nredelivery, and the Aircraft isreturned in an airworthy condition, free from any liens or\nencumbrances. The Lessor has conducted a technical inspection of the Aircraft, which\nincludes:\no Review of the airframe, engines, and landing gear cycles and hours.\no Inspection of the Aircraft’s interior, avionicssystems, and other operational\ncomponents.\no Verification that the Aircraft complies with all relevant airworthiness directives(ADs),\nservice bulletins (SBs), and regulatory requirements.\nThe Aircraft isfound to be in compliance with the redelivery conditions asstipulated in the Lease\nAgreement.\n3. Certification of Compliance:\nThe Aircraft is certified as compliant with the applicable regulations of Transport Canada Civil\nAviation (TCCA) and the Federal Aviation Administration (FAA). The Lessee has provided all\nnecessary documentation, including the updated Certificate of Airworthiness, logbooks,\nmaintenance records, service history, and weight and balance reports. No significant defects\nor overdue maintenance items were identified during the redelivery inspection.\n4. Acceptance by Lessor:\nThe Lessor hereby acknowledges and acceptsthe redelivery of the Aircraft in accordance\nwith the terms of the Lease Agreement. The Aircraft is accepted in satisfactory condition for\nfuture operations, and all technical and maintenance conditionsrequired for redelivery have\nbeen met. This Certificate shall serve asformal evidence of the Aircraft’s redelivery to the\nLessor as of August 10, 2025.\nI2\nAeroSky Rentals Ltd. (Lessor)\nName: Emily Johnson\nTitle: Chief Financial Officer\nDate: August 10, 2025\nBlueJet Airways Corp. (Lessee)\nName: Michael Brown\nTitle: Vice President of Operations\nDate: August 10, 2025\nJ1\nExhibit J\nDeregistration Power of Attorney\nThis Deregistration Power of Attorney (\"Power of Attorney\") is executed on this August 10, 2025, by\nBlueJet Airways Corp., a company organized under the laws of the United Kingdom (\"Lessee\"), in\nfavor of AeroSky Rentals Ltd., a company organized under the laws of Canada (\"Lessor\").\n1. Appointment and Authority\nThe Lessee hereby irrevocably appointsthe Lessor, its directors, officers, and any designated\nrepresentatives, as its true and lawful attorney-in-fact with full power and authority to act in the\nname and on behalf of the Lessee for the sole purpose of effectuating the deregistration of the\nAircraft described below from the Civil Aviation Authority of Ireland and any other applicable aviation\nregistry.",
    "chunk_order_index": 13,
    "full_doc_id": "doc-b3a6e9bbeadb1ead45aa26dc71caade6"
  },
  "chunk-a4fe1b907d49f6371a20756523a22bd7": {
    "tokens": 460,
    "content": "company organized under the laws of Canada (\"Lessor\").\n1. Appointment and Authority\nThe Lessee hereby irrevocably appointsthe Lessor, its directors, officers, and any designated\nrepresentatives, as its true and lawful attorney-in-fact with full power and authority to act in the\nname and on behalf of the Lessee for the sole purpose of effectuating the deregistration of the\nAircraft described below from the Civil Aviation Authority of Ireland and any other applicable aviation\nregistry.\n2. AircraftIdentification\nThis Power of Attorney appliesto the following aircraft(\"Aircraft\"):\n Aircraft Model: SkyLiner A350\n Manufacturer’s Serial Number: 2098745\n Registration Number: G12345\n Engines: Two (2) Pratt & Whitney PW4000 engines\n3. Scope of Powers\nThe Lessor is hereby granted full authority to perform any and all acts necessary to deregister the\nAircraft, including but not limited to:\n Filing applications, forms, and documents with the relevant civil aviation authorities or\ngovernmental entities.\n Executing and delivering any documentsrequired to complete the deregistration process.\n Taking any actionsreasonably necessary to effectuate the export of the Aircraft, if applicable.\n Signing any letters, declarations, or certificationsrequired for deregistration.\n4. Effective Date and Duration\nThis Power of Attorney shall become effective on the date of execution and shall remain in full force\nand effect until such time asthe Aircraft has been fully deregistered from the applicable aviation\nregistry. The Lessee expressly waives any right to revoke this Power of Attorney prior to the\ncompletion of the deregistration process.\n5. Indemnity\nThe Lessee agreesto indemnify and hold harmless the Lessor, its officers, and representativesfrom\nany liabilities, claims, or damages arising out of actions taken in good faith under this Power of\nAttorney in connection with the deregistration of the Aircraft.\n6. Governing Law\nJ2\nThis Power of Attorney shall be governed by, and construed in accordance with, the laws of UK,\nwithout regard to its conflicts of law principles.\nBlueJet Airways Corp.(Lessee)\nName: Michael Brown\nTitle: Vice President of Operations\nDate: August 10, 2025",
    "chunk_order_index": 14,
    "full_doc_id": "doc-b3a6e9bbeadb1ead45aa26dc71caade6"
  }
}